module.exports = {
  /* CONSTs in config.js */
  MSG_ERR: [
    '我失去了右手，失去了父亲，失去了儿子，失去了姐姐，失去了爱情，不久连弟弟也要失去。可他们居然告诉我，服务器没有了响应！',
    '“既然服务器①已经挂了，”眼看周围的树林逐渐黯淡，盖瑞不禁催促，“咱们回头吧。”',
    '“伊戈？”他回应道，雨水顺着他的脸颊流淌下来，“伊戈，我梦到服务器无响应了。”',
    '立刻回来吧，她说，帮助我，拯救我，我比任何时候都更需要你。我爱你，我爱你，我爱你。服务器回来吧。'
  ],
  MSG_NORESULT: [
    '啊，你跟我说你找不到我想要的东西，是吗？不错不错，我再问你一次。村里藏有金子吗？银子和珠宝呢？存粮呢？贝里·唐德利恩伯爵在哪儿？他离开后去了哪儿？身边有多少人？其中有多少骑士，多少弓手，多少步兵？有多少，有多少，有多少，有多少，有多少，有多少？村里藏有金子吗？',
    '“噢，”耶哥蕊特捧起他的脸颊，“你什么都没找到，琼恩·雪诺。”她幽幽地叹口气，死了。',
    '有些秘密永远不该提起，有些耻辱一个男人应该将其带入坟墓。\n　　——提利昂·兰尼斯特',
    '你想要寻找的，我没有能力帮你取得，只因为它藏在布拉佛斯的铁金库中。',
    '布蕾妮低头。“我将尽力而为，夫人。”\n……然而这并没有什么卵用。'
  ],
  MSG_SUBSCRIBE: '感谢订阅冰与火之歌中文维基。本公众号如同一部随身辞典，帮助您轻松查阅名词释义、领略冰火世界的奇幻风光。北至永冬之地，南抵索斯罗斯；西达日落之海，东及阴影之地。冰火中文维基包罗万象、竭诚为您服务。丹妮、御林铁卫、瓦雷利亚钢，键入任何您感兴趣的名词、体验冰火世界的魅力所在。\n如有疑问，回复1查看帮助~ :）',

  /* other CONSTs */
  K_HELP: '1',
  MSG_EMOTION_FORBIDDEN: '“停下，你这小笨蛋，”他边喊边晃她，“快停下！”'
};
