var util = require('node-huiji').Util;
var consts = require('./consts.js');

var hackJonSnow = ['琼恩', '囧', '囧恩', '穷恩', '穷嗯', '雪诺', '斯诺', '囧雪', 'jon', 'john', 'Jon', 'John', 'jon snow', 'Jon snow', 'john snow', 'John snow', 'John Snow'];
module.exports = [
  /* hack for K_HELP */
  {
    key: ['帮助', '使用帮助', 'help', 'HELP', 'h', '指南', '使用指南', '怎么用'],
    value: consts.K_HELP
  },
  /* hack for [[琼恩·雪诺/生死之谜]] */
  {
    key: util.hackFunc({
      'all': ['死'],
      'one': hackJonSnow
    }, {
      'all': [],
      'one': ['艾林', '艾琳', '拉姆斯', '小剥皮']
    }),
    value: '琼恩·雪诺/生死之谜'
  },
  {
    key: ['史塔克', '狼家', '斯塔克', '斯达克'],
    value: '史塔克家族'
  },
  {
    key: ['猫姨', '凯瑟琳'],
    value: '凯特琳·徒利'
  },
  {
    key: ['小妹', '二丫', '艾莉亚', '艾丽娅', '艾利娅', '艾利亚', '小狼女', '艾丽雅', '艾利雅'],
    value: '艾莉亚·史塔克'
  },
  {
    key: hackJonSnow,
    value: '琼恩·雪诺'
  },
  {
    key: ['火吻', '野鸽'],
    value: '耶哥蕊特'
  },
  {
    key: ['卢斯', '露丝', '露斯'],
    value: '卢斯·波顿'
  },
  {
    key: ['二鹿', '斯坦尼斯'],
    value: '史坦尼斯·拜拉席恩'
  },
  {
    key: ['梅姨', '红姨', '红袍女', '美丽山猪', '美丽山竹', '山猪'],
    value: '梅丽珊卓'
  },
  {
    key: ['大帝', '乔大帝', '乔弗里', '乔佛理'],
    value: '乔佛里·拜拉席恩'
  },
  {
    key: ['色后', '色系', '瑟熙'],
    value: '瑟曦·兰尼斯特'
  },
  {
    key: ['詹米', '杰米', '杨过'],
    value: '詹姆·兰尼斯特'
  },
  {
    key: ['温泰', 'Tywin', 'Tylose', '黄金屎', '泰泰', 'tywin', 'tylose'],
    value: '泰温·兰尼斯特'
  },
  {
    key: ['龙妈', '龙母', '丹妮', '豌豆射手', '丹尼莉丝', '丹妮莉斯', '丹妮丽斯', '丹妮丽丝'],
    value: '丹妮莉丝·坦格利安'
  },
  {
    key: ['老巴', '八卦', '八卦斯坦', '巴基斯坦', '巴勒斯坦'],
    value: '巴利斯坦·赛尔弥'
  },
  {
    key: ['小文书', '翻译', '女翻译', '小翻译', '女文书'],
    value: '弥桑黛'
  },
  {
    key: ['老学士', '伊萌', '伊萌坦格利安', '萌萌', 'AemonTargaryen', 'Moemoe', 'moemoe', '老瞎子', '老瞎眼'],
    value: '伊蒙学士'
  },
  {
    key: ['疯王', '先王', '疯疯', '轰轰', '老疯子'],
    value: '伊里斯二世'
  },
  /* hack for emotion */
  {
    key: {
      '/::)': '微笑骑士',
      '/:8-)': '伊蒙学士',
      '/::+': '伊蒙学士',
      '/::Z': '哈兰·格兰德森',
      '/::Q': '乔佛里·拜拉席恩',
      '/::>': '莱昂诺·拜拉席恩',
      '/:?': '琼恩·雪诺',
      '/:!!!': '异鬼',
      '/:xx': '贝勒·坦格利安(戴伦二世之子)',
      '/:bye': '詹姆·兰尼斯特',
      '/:beer': '劳勃·拜拉席恩',
      '/:pig': '梅丽珊卓',
      '/:rose': '玛格丽·提利尔',
      '/:li': '贝里·唐德利恩',
      '/:shit': '泰温·兰尼斯特',
      '/:sun': '蓝礼·拜拉席恩',
      '/:bad': '培提尔·贝里席',
      '/:@@': '戴佛斯·席渥斯',
      '/:lvu': '哈布',
      '/:ok': '哈布',
      '/::X': '伊林·派恩'
    },
    value: undefined
  },
  /* direct redirection */
  {
    key: {
      '斯塔克': '史塔克',
      '奶德': '艾德·史塔克',
      '猫姨': '凯特琳·徒利',
      '萝卜': '罗柏·史塔克',
      '小妹': '艾莉亚·史塔克',
      '三傻': '珊莎·史塔克',
      '萌神': '布兰·史塔克',
      '核桃大帝': '瑞肯·史塔克',
      '小护士': 'TV:泰丽莎·梅葛亚',
      '血色婚礼': '红色婚礼',
      '贾坤': '贾昆·赫加尔',
      '鬣狗': '桑铎·克里冈',
      '磨山': '格雷果·克里冈',
      '冯凯': '凯冯·兰尼斯特',
      '三鹿': '蓝礼·拜拉席恩',
      '蜡烛': '洛拉斯·提利尔',
      '小玫瑰': '玛格丽·提利尔',
      '荆棘': '奥莲娜·雷德温',
      '塔格利安': '坦格利安',
      '龙家': '坦格利安家族',
      '鹿家': '拜拉席恩家族',
      '鹰家': '艾林家族',
      '鱼家': '徒利家族',
      '鱿鱼家': '葛雷乔伊家族',
      '玫瑰家': '提利尔家族',
      '蛋蛋': '伊耿·坦格利安五世',
      '血压': '布林登·河文',
      '权利的游戏': '权力的游戏',
      '异形者': '易形者',
      '衣柜': '异鬼', 
      '湿柜': '尸鬼'
    },
    value: undefined
  }
];
